; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(on b1 b4)
(ontable b2)
(ontable b3)
(ontable b4)
(on b5 b7)
(on b6 b5)
(ontable b7)
(on b8 b2)
(on b9 b6)
(clear b1)
(clear b3)
(clear b8)
(clear b9)
)
(:goal
(and
(on b1 b6)
(on b2 b8)
(on b3 b2)
(on b4 b5)
(on b7 b9)
(on b8 b1)
(on b9 b4))
)
)

; plan
1. (move-b-to-b b9 b6 b3)
   deleted: (clear b3) (on b9 b6)
   added: (on b9 b3) (clear b6)
   goals met: 0 of 7
2. (move-b-to-t b6 b5)
   deleted: (on b6 b5)
   added: (ontable b6) (clear b5)
   goals met: 0 of 7
3. (move-b-to-t b5 b7)
   deleted: (on b5 b7)
   added: (ontable b5) (clear b7)
   goals met: 0 of 7
4. (move-b-to-b b1 b4 b6)
   deleted: (clear b6) (on b1 b4)
   added: (on b1 b6) (clear b4)
   goals met: 1 of 7
5. (move-b-to-b b8 b2 b1)
   deleted: (clear b1) (on b8 b2)
   added: (on b8 b1) (clear b2)
   goals met: 2 of 7
6. (move-t-to-b b2 b8)
   deleted: (clear b8) (ontable b2)
   added: (on b2 b8)
   goals met: 3 of 7
7. (move-t-to-b b4 b5)
   deleted: (clear b5) (ontable b4)
   added: (on b4 b5)
   goals met: 4 of 7
8. (move-b-to-b b9 b3 b4)
   deleted: (clear b4) (on b9 b3)
   added: (on b9 b4) (clear b3)
   goals met: 5 of 7
9. (move-t-to-b b3 b2)
   deleted: (clear b2) (ontable b3)
   added: (on b3 b2)
   goals met: 6 of 7
10. (move-t-to-b b7 b9)
   deleted: (clear b9) (ontable b7)
   added: (on b7 b9)
   goals met: 7 of 7
